{"pageProps":{"articleData":{"id":"about","contentHtml":"<h1>About The Festival</h1>\n<section>\n<h2>Our Mission &#x26; History</h2>\n<p>The mission of the Carnegie Mellon International \"Faces\" Film Festival is to engage the Pittsburgh community with all-encompassing programming that promotes cultural exchange and expression, and through film, illuminates the local and global ethnic communities which seldom have opportunities to celebrate their artwork and culture on a large public scale. By collaborating with guest filmmakers, arts organizations, and local businesses, the festival creates a platform for these ethnic groups to expose the Pittsburgh community to their cultures, allows attendees to identify and relate to their own origins, and for cinematic artists to engage audiences with their films and dialogues.</p>\n<p>Created in 2006, the Carnegie Mellon International “Faces” Film Festival is a project of the Humanities Center at Carnegie Mellon University (CMU), which has supported research and encouraged interest in the humanities for more than 15 years. The festival serves as a non-academic bridge to the greater Pittsburgh community, and opens its doors each year to the interests and passions of people across generations and cultures.</p>\n<p>The “Faces” Film Festival takes place every year in the spring and presents a wide spectrum of contemporary world cinema, focusing on a different annual theme that addresses a current social issue. The festival presents 14-18 international narrative features, documentaries, and shorts each year. As a community-building event, screenings are accompanied by supplementary components such as Q &#x26; A sessions with the films’ directors and local academics, artistic performances, and receptions with local ethnic cuisine. In this way, the events are more than just film premieres; they are cultural celebrations that allow audiences to observe, discuss, and experience international cultures.</p>\n<p>The “Faces” Film Festival prides itself in being the only international film festival in the world organized and run by university students from the numerous educational institutions across Pittsburgh, such as CMU and the University of Pittsburgh. The students build events around the festival’s rich variety of films from the U.S., Egypt, France, Australia, China, Iran, Peru, Poland, Japan, Germany, Belarus, Korea, and many other countries, hoping to reinforce Pittsburgh’s ethnic history and living culture.</p>\n<p>The Carnegie Mellon International Film Festival is dedicated to the late Paul Goodman, a world- renowned filmmaker, psychologist, and CMU professor. The festival mirrors Paul's dedication to global awareness in his teaching and research, and his desire to bring to light important but often overlooked aspects of diverse individuals through filmmaking.</p>\n</section>\n<section>\r\n<div class=\"trailer-container\">\r\n<iframe class=\"trailer\" width=\"699\" height=\"393\" src=\"https://www.youtube.com/embed/49cM5EivEQc\" title=\"YouTube video player\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture\" allowfullscreen></iframe>\r\n</div>\r\n</section>\n<section>\n<h2>Paul Goodman &#x26; His Work</h2>\n<p><img src=\"$basePublicPath$/assets/mission/PaulGoodman.png\" alt=\"Paul Goodman at his desk\"></p>\n<p>Paul Goodman was an acclaimed psychologist, author, researcher, and filmmaker who first joined the Carnegie Mellon faculty in 1972. He went on to become a tenured professor of industrial administration and psychology in 1979 and the honorable Richard M. Cyert Professor of Organizational Psychology in 2000.</p>\n<p>During his influential years at Carnegie Mellon, Paul made great efforts to expand the global reach of the university. As a professor and a filmmaker, he sought creative ways to connect students with work and technology in both local and international contexts. As Mark Kamlet, provost and executive vice president at Carnegie Mellon, asserts, “He was successful in developing strategic partnerships in Asia, Latin and South America, the Middle East and South Africa. He has been a champion of the university around the world, helping to expand Carnegie Mellon’s reach and influence while raising education standards in developing countries.” Some of his initiatives abroad included the exploration of environmental issues and technological development at leading universities in Brazil and Chile, the establishment of a program designed to improve the quality of engineering schools in India, the development of a program to build a leadership institute facilitating Jewish-Arab co-existence in Israel, and the building of a new School of Information Systems in Singapore.</p>\n<p>While Paul strongly emphasized global awareness in his teaching and research, he was also dedicated to exploring the theme of work in the local Pittsburgh community. He aimed to draw attention to the crucial value in everyday people who worked daily to improve our economy and social well-being, despite being largely unrecognized for their essential contributions. His exploration of workers in action granted him the opportunity to not only learn more about different business strategies, but also to embark on exciting projects using his favorite teaching tool – filmmaking. Among more than 20 educational films and documentaries that he produced, he highlights the important but often overlooked work of individuals such as a nurse, a factory worker, a glass blower, a fisherman, and a women’s rowing team.</p>\n<p>Paul shares his global business research and strategies with us not only through the nine books and dozens of articles he has published, but also through short films and full-length documentaries that offer insight into the daily lives of international workers and their ideas for economic development. Through a variety of media, he shows us how important, multidisciplinary work improves our local and global societies in numerous ways. ideas that impact.</p>\n<p>In the 1980s, Paul Goodman produced 20 educational short films, in addition to two feature-length documentaries, as a part of <a href=\"http://dli.library.cmu.edu/paulgoodman/home\">\"The Changing Nature of Work”</a> series. Created for the classroom, these films show how global development and technological expansion are changing the nature of workplace demographics and methods of production, featuring commentary from a variety of workers in local, national, and global contexts.</p>\n<p><a href=\"http://dli.library.cmu.edu/paulgoodman/home\">“The Changing Nature of Work”</a> series is now available for viewing on the Carnegie Mellon Library website.</p>\n</section>\n","title":"About","activeItem":2}},"__N_SSG":true}