{"pageProps":{"articleData":{"id":"special_events","contentHtml":"<h1>2022 Special Events</h1>\n<section id=\"casablanca-beats\">\n<h2>Opening Night Event</h2>\n<h5>Thursday, March 24th | 7:00PM | McConomy Auditorium, CMU</h5>\n<p>On opening night, the CMUIFF chooses a film which best represents our current theme. For \"FACES BEHIND THE MASK,\" there is no film better suited than <em>Casablanca Beats</em>. Through the film's focus on diverse realities— all beset by social unrest, insurmountable odds, and inner turmoil—as the basis of storytelling, the film seeks to explore what matters now to young people in Morocco, and how they may shape its future. <em>Casablanca Beats</em> is the perfect place to start our discussion on masks and the different faces we present to the world, each tailor-made to our individual lives.</p>\n<p>At the Opening Night Ceremony, the CMUIFF will host a hip-hop performance by local group Helix, followed by a screening of Nabil Ayouch's <em>Casablanca Beats</em>. Nevine Abraham, Carnegie Mellon University's Department of Modern Languages Principle Instructor of Arabic Studies, will moderate a post-film Q&#x26;A discussion with director Nabil Ayoub.</p>\n<p>The Opening Night Reception will include catering by Ali Baba.</p>\n<p>Co-presented with CMU’s Center for the Arts in Society and Humanities Scholars Program\r\nCo-sponsored by CMU’s Department of Modern Languages and Arab Student Organization</p>\n</section>\n<section id=\"trenches\">\n<h2><em>Trenches</em> Panel Discussion</h2>\n<h5>Friday, March 25th | 7:00PM | McConomy Auditorium, CMU</h5>\n<p>In light of the Russian invasion of Ukraine, the CMUIFF marks Loup Bureau's <em>Trenches</em> as of particular importance to the festival itself, as well as to the local Pittsburgh community and beyond as a way to express solidarity with the people of Ukraine. Following the screening of <em>Trenches</em>, an inside look at what the conflict between Russian-backed separatists and Ukraine was before full-scale invasion, University of Pittsburgh professors Will Zavala, Adriana Helbig, Tetyana Shlikhar, and Trevor Erlacher will take part in a panel discussion moderated by Carnegie Mellon University professor Emanuela Grama.</p>\n<p>Co-presented with CMU’s Department of History and Pitt's Center for Russian, East European &#x26; Eurasian Studies and Department of Slavic Languages and Literatures</p>\n<p>Co-sponsored by CMU’s Department of Modern Languages and Pitt’s Department of Slavic Languages and Literatures</p>\n</section>\n<section id=\"devils-driver\">\n<h2><em>The Devil's Drivers</em> Panel Discussion</h2>\n<h5>Sunday, March 27th | 3:00PM | McConomy Auditorium, CMU</h5>\n<p>The CMUIFF is excited to host a post-screening panel for <em>The Devil's Drivers</em>, a film that looks candidly at the conditions in the Palestinian Territories, and how desperation drives ever-riskier confrontations and strategies to make ends meet. <em>Panel participants are to be announced soon.</em></p>\n<p>Co-sponsored by Pittsburgh Palestinian Solidarity Committee, J Street Pittsburgh, Pittsburgh Documentary Salon, and CMU’s Department of Modern Languages</p>\n</section>\n<section id=\"silent-land\">\n<h2>Closing Night Event</h2>\n<h5>Saturday, April 9th | 7:30PM | Harris Theater</h5>\n<p>While the Closing Night Event brings CMUIFF's \"FACES BEHIND THE MASK\" to a close, the conversations about masks and the things hidden behind them will continue beyond the confines of the theater. Agnieszka Woszczyńska's <em>Silent Land</em> takes us on a journey of suppressed emotions, human frailty, and moral downfalls in her poetically portrayed debut film, where the facade of the blissful couple slowly unravels and is torn to pieces. Our last film will be certain to leave us with a complete view of the power that masks have.</p>\n<p>A post-film Q&#x26;A discussion with director Agnieszka Woszczyńska will take place, followed by a Closing Night Reception.</p>\n<p>We are honored to host special guest Artur Zaborski for our closing night event. Having graduated from Jagiellonian University, Artur Zaborski has embarked on an illustrious journalism career, writing for publications ranging from Vogue and Tygodnik Wprost to Wirtualna Polska and Newsweek. He has also lectured for Warszawska Szkoła Filmowa.</p>\n<p>Co-sponsored by Polish Falcons of America and Pitt’s Department of Slavic Languages and Literatures and Center for Russian, East European &#x26; Eurasian Studies</p>\n<p>Supported by The Polish Institute in New York and Polish Cultural Council in Pittsburgh</p>\n</section>\n","title":"Special Events","activeItem":1}},"__N_SSG":true}