{"pageProps":{"articleData":{"id":"internships","contentHtml":"<h1>Internships</h1>\n<section>\n<p>Year-long, part-time positions in Logistics, Marketing and Communications, Design, Development, Social Media, Programming, Youth Coordination, Event Coordination, Photography, and Web Management are available through the 2019-2020 CMU International Film Festival. Applicants should be able to dedicate flexible hours each week to Film Festival responsibilities and experiences, with extended hours 3-4 weeks before the Festival begins and during the Festival season in the Spring. For position descriptions, see below</p>\n<p>For interns, the CMU IFF is a great opportunity to broaden your work skills, heighten your existing talents, and build new ones, as you also broaden your network of connections both here in Pittsburgh and internationally. The Festival is known for bringing successful filmmakers to Pittsburgh for its events, including names such as Jonathan Demme (Director of Silence of the Lambs) in 2015 and Spike Lee (Director of Do the Right Thing) in 2016. Festival interns are always in for something exciting during their year with the CMU IFF.</p>\n<p><strong>Interested applicants, please send your resume as well as any other requested portfolio samples to the Festival Director, Jolanta Lion at <a href=\"mailto:jola@andrew.cmu.edu\">jola@andrew.cmu.edu</a>.</strong></p>\n</section>\n<section>\n<h2>Position Descriptions</h2>\n<p>All positions fit under their respective umbrella committees. The Festival Committees comprise the structure of the Festival team. These include:</p>\n<ul>\n<li>Logistics</li>\n<li>Event Coordination</li>\n<li>Programming</li>\n<li>Development</li>\n<li>Marketing &#x26; Communications</li>\n<li>Design</li>\n<li>Youth Outreach Program</li>\n<li>Short Film Competition</li>\n<li>Web Development</li>\n</ul>\n<p><strong>All interns must:</strong></p>\n<ul>\n<li>Be able to meet in-person, once a week with the rest of the team. Date of said meeting is TBD based on availability.</li>\n<li>Possess advanced writing skills.</li>\n<li>Possess strong organizational skills.</li>\n<li>Share an interest in the contemporary film industry.</li>\n</ul>\n<p><a href=\"https://drive.google.com/file/d/1wtGHalSLe0PrOqKry4G0g6owY3TL1y_C/view\"><button class=\"btn btn-light\">View Available Positions</button></a></p>\n</section>\n","title":"Internships","activeItem":4}},"__N_SSG":true}