{"pageProps":{"filmId":"ascension","filmData":{"id":"ascension","contentHtml":"<section>\n<h2>About the Film</h2>\n<blockquote class=\"blockquote\">\r\n  <p class=\"mb-0\">\"As engrossing as it’s alarming, the documentary flows with a stream of consciousness about the illusion of the 'Chinese Dream.' Without blunt commentary other than the subtext Kingdon instills through the curation of the material, and some candid remarks of anonymous subjects, 'Ascension' ruminates on many places of employment and career-advancement programs.\"</p>\r\n  <p class=\"blockquote-footer\">RogerEbert.com</p>\r\n</blockquote>\n<p>Jessica Kingdon’s observational documentary <em>Ascension</em> delves into the “Chinese dream” and contemporary Chinese identity, primarily in its relation to social conditions, economic standing, and innovation. Captivating vignettes of the day-to-day lives of individuals shed light on the sharp differences that exist within the expanding social stratification. This documentary captures each level of capitalism as it exists in China, and the relentless pursuit of productivity that extends from the top of the power structure down to the individual level. Kingdon fixates on the impact of capitalism on the individual, and on the interconnected nature of the system as a whole.  As the film moves across the social spectrum, the viewer is able to see how each level acts as a support for the next, and how mobility between levels is almost impossible.</p>\n</section>\n<section>\n<h2>Film Trailer</h2>\n<div class=\"trailer-container\">\r\n    <iframe width=\"590\" height=\"332\" src=\"https://www.youtube.com/embed/ojRgr6h68IQ\" title=\"YouTube video player\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture\" allowfullscreen></iframe>\r\n</div>\n</section>\n<section>\n<h2>Awards</h2>\n<ul>\n<li><em>7 wins and 24 nominations</em></li>\n<li>Denver International Film Festival – winner of Honorable Mention</li>\n<li>Gold List – Best Documentary Feature</li>\n<li>Hamptons International Film Festival – Documentary Feature</li>\n<li>National Board of Review, USA – top Five Documentaries</li>\n<li>Tacoma Film Festival – Documentary Feature</li>\n<li>Tribeca Film Festival – New Documentary Director Award, best documentary feature</li>\n</ul>\n</section>\n<section>\n<h2>About the Director</h2>\n<p><img src=\"/faces/assets/films/director_headshots/image13.png\" alt=\"Director headshot\"></p>\n<p><strong>Jessica Kingdon</strong> is a Chinese-American director and producer named one of “25 New Faces of Independent Film” by Filmmaker Magazine and selected for the 2020 DOC NYC “40 Under 40” list. Her first documentary feature, Ascension,  <em>登楼叹</em> (2021), was nominated for the 94th Academy Awards in the Best Documentary Feature category as well as for Best Documentary at the Tribeca Festival and Hamptons International Film Festival. Her award-winning short <em>Commodity City</em> (2017) is an observational documentary about the world’s largest wholesale mall in Yiwu, China and played at over 50 film festivals. She also co-directed the short <em>It’s Coming</em> (2020), and <em>Routine Island</em> (2019). Her residencies include UnionDocs and a MacDowell Fellowship.</p>\n</section>\n","excerptHtml":"","title":"Ascension","runTime":"97 min","country":"United States","releaseYear":"2021","language":"Chinese","director":"Jessica Kingdon","screening_location":"Harris Theater","screening_time":"April 07 2022 07:30 PM EDT","banner_img_src":"/FilmPage_Ascension.png","director_img_src":"/image13.png","sponsors":[],"sponsors_text":"<p>Co-presented with  SCREENSHOT: ASIA</p><p>Co-sponsored by Pittsburgh Documentary Salon and Pitt’s Asian Studies Center, and CMU’s Department of Modern Languages and Center for Student Diversity and Inclusion</p>","hasExcerpt":true},"sponsorsData":[]},"__N_SSG":true}