{"pageProps":{"filmId":"luzzu","filmData":{"id":"luzzu","contentHtml":"<section>\n<h2>About the Film</h2>\n<blockquote class=\"blockquote\">\r\n  <p class=\"mb-0\">\"In 'Luzzu,' his first feature film, Camilleri demonstrates a sophisticated understanding of how small moments can build a sense of place: sandals on the salty floor of a fishery; a metal scraper peeling paint from a hull; a priest blessing boats for safe passage. Malta’s views are arresting, but the images Camilleri chooses would never be found in a travel brochure. In his subtle, vérité approach, he captures something special — not one man’s crisis, but a community’s culture.\"</p>\r\n  <p class=\"blockquote-footer\">The New York Times</p>\r\n</blockquote>\n<p>Jesmark, a Maltese fisherman, comes up against a moral, economic, and social dilemma when his wooden fishing boat starts leaking. Should he fix up the small boat and go back to making a meager living, or should he sell the boat and pursue a different, and morally questionable, line of work offering greater payouts. To further complicate the decision, Jesmark must carefully consider the repercussions each choice will have on his wife and newborn son. Does he follow the traditional way of life, the job practiced by his family for generations? Or does he pursue higher rewards that will enable him to provide for his family with ease? Camilleri captures the plight of the small-time working class, and the ways an ever-growing economy and market continually challenge their livelihoods and force them to make crucial decisions.</p>\n</section>\n<section>\n<h2>Film Trailer</h2>\n<div class=\"trailer-container\">\r\n    <iframe width=\"640\" height=\"360\" src=\"https://www.youtube.com/embed/1kPHPM8kYQE\" title=\"YouTube video player\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture\" allowfullscreen></iframe>\r\n</div>\n</section>\n<section>\n<h2>Awards</h2>\n<ul>\n<li><em>4 wins &#x26; 14 nominations</em></li>\n<li>Molodist International Film Festival – Winner of Full-Length Competition</li>\n<li>Skip City International D-Cinema Festival – Winner of Feature Film</li>\n<li>Sofia International film Festival – Winner of Best Film</li>\n<li>Sundance Film Festival – Winner of Acting</li>\n</ul>\n</section>\n<section>\n<h2>About the Director</h2>\n<p><img src=\"/faces/assets/films/director_headshots/image8.png\" alt=\"Director headshot\"></p>\n<p><strong>Alex Camilleri</strong> is a Maltese-American filmmaker who studied English and Film at Vassar College. He is an alumnus of both the Sundance and Film Independent labs, and is known for his feature length film <em>Luzzu</em> (2021), which won national funding in Malta and was chosen for the prestigious Les Arcs Works-In-Progress screening. It is Malta’s submission to the 94th Academy Awards. His film credits include <em>Keep The Change</em> (2017), which won Best Film and Best Director at Tribeca and <em>Blood Kin</em> (2018). He was also an Associate Editor on HBO’s <em>Fahrenheit 451</em> (2018).</p>\n</section>\n","excerptHtml":"","title":"Luzzu","runTime":"95 min","country":"Malta","releaseYear":"2021","language":"Maltese, English","director":"Alex Camilleri","screening_location":"McConomy Auditorium","screening_time":"March 31 2022 07:00 PM EDT","banner_img_src":"/FilmPage_Luzzu.png","director_img_src":"/image8.png","sponsors":[],"sponsors_text":"<p>Sponsored by CMU’s Department of English</p>","hasExcerpt":true},"sponsorsData":[]},"__N_SSG":true}