{"pageProps":{"filmId":"silent-land","filmData":{"id":"silent-land","contentHtml":"<section>\n<h2>About the Film</h2>\n<blockquote class=\"blockquote\">\r\n  <p class=\"mb-0\">\"Her film is like poetry itself – distilled, with every word used purposefully and carefully, and indeed, her characters bring to mind the TS Eliot poem The Hollow Men. However, Silent Land is not just observational, slow cinema; it’s also a distinct and socially engaged whisper.\"</p>\r\n  <p class=\"blockquote-footer\">Cineuropa</p>\r\n</blockquote>\n<p>Female director and screenwriter Aga Woszczyńska’s debut feature-length film follows a seemingly perfect young Polish couple on summer vacation on an Italian island. Following a tragic accident at the residence, their vacation soon unravels. Artistically subtle, tense, and deliberate, the facade of the blissful couple is slowly unraveled and torn to pieces with each scene. Through a variety of cinematic tools, Woszczyńska establishes a powerful atmosphere of looming fear, with the always-present question of what happens next. <em>Silent Land</em> depicts suppressed emotions, human frailty, and moral downfalls in a poetically portrayed debut film.</p>\n</section>\n<section>\n<h2>Film Trailer</h2>\n<div class=\"trailer-container\">\r\n    <iframe width=\"574\" height=\"323\" src=\"https://www.youtube.com/embed/f3NR82LIemc\" title=\"YouTube video player\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture\" allowfullscreen></iframe>\r\n</div>\n</section>\n<section>\n<h2>Awards</h2>\n<ul>\n<li><em>3 Nominations</em></li>\n<li>Chicago International Film Festival – Nominee of New Directors Competition</li>\n<li>Toronto International Film Festival – Nominee of Platform Prize</li>\n<li>Zurich Film Festival – Nominee of Best International Feature Film</li>\n</ul>\n</section>\n<section>\n<h2>About the Director</h2>\n<p><img src=\"/faces/assets/films/director_headshots/image3.png\" alt=\"Director headshot\"></p>\n<p>Born in 1984 in Łódź, Poland, <strong>Agnieszka Woszczyńska</strong> is a director, scriptwriter, and anthropologist. She has a degree in Applied Social Science and graduated from The Polish National Film School Directing Department in Lódź in 2014. Her short films have been presented and won awards at numerous film festivals, including the Cannes Film Festival, the Helsinki International Film Festival, T-Mobile New Horizons, Sao Paulo Kinoforum and the  Film Festival. Her graduation short film <em>Fragments</em> (2014) had its international Premiere at Cannes’ Directors' Fortnight. <em>Silent Land</em> (2021), which premiered in the Toronto IFF Platform Competition, marks Woszczyńska’s debut feature film. She is currently working on her second feature, <em>Black Water</em>.</p>\n</section>\n","excerptHtml":"","title":"Silent Land","runTime":"113 min","country":"Poland / Italy / Czech Republic","releaseYear":"2021","language":"Polish, English, French, Italian","director":"Agnieszka Woszczyńska","screening_location":"Harris Theater","screening_time":"April 09 2022 07:30 PM EDT","banner_img_src":"/FilmPage_SilentLand.png","director_img_src":"/image3.png","sponsors":[],"sponsors_text":"<p>Co-sponsored by Polish Falcons of America and Pitt’s Department of Slavic Languages and Literatures and Center for Russian, East European & Eurasian Studies</p><p>Supported by The Polish Institute in New York and Polish Cultural Council in Pittsburgh</p>","hasExcerpt":true},"sponsorsData":[]},"__N_SSG":true}