{"pageProps":{"articleData":{"id":"sfc","contentHtml":"<h1>2021 Short Film Competition</h1>\n<section>\n<h2>2021 Winners</h2>\n<p>Find out who the winners of the 2020-2021 CMU IFF Short Film Competition are! Thank you to all of the wonderful filmmakers that submitted their work! It was a hard decision but we really enjoyed watching all the films that were submitted!</p>\n<p><strong>1st place ($1,000)</strong> - An Occurrence at Averne, Director Robert Broadhurst<br>\n<strong>2nd place ($500)</strong> - Sofia's Tapestry, Director Manya Glassman<br>\n<strong>Audience choice ($250)</strong> - Mother's Day, Director Olivia Gee</p>\n<p>We look forward to seeing you all again next year!</p>\n<p>Tickets for the event are no longer on sale.</p>\n</section>\n<section>\n<h2>About the Competition</h2>\n<p>Welcome to 2021 Carnegie Mellon International “Faces” Film Festival Student Short Film Competition!</p>\n<p>The CMU International Film Festival’s Short Film Competition (SFC) is an annual competition that aims to gather cinematic perspectives from around the world on a current social issue or idea. Our annual competition event unites local filmmakers with professionals and with in-house audiences; all the eyes a filmmaker could ask for under one roof. The SFC invites and encourages independent local filmmakers to submit a short film of their making that presents a unique vision, and creates poignant conversation.</p>\n<p>For more info about this year’s Short Film Competition, please download our “Guidelines” document.</p>\n<p><a href=\"https://www.cmu.edu/faces/Assets/Short_Film_Competition/CMU%20IFF%20Short%20Film%20Competition%202021.pdf\"><button class=\"btn btn-primary\">View SFC Guidelines</button></a></p>\n</section>\n<section>\n<h2>Awards</h2>\n<p><strong>Grand Prize</strong>*: $1,000<br>\n<strong>Second Prize</strong>*: $500<br>\n<strong>Audience Prize</strong>: $250</p>\n<p>*The Grand and Second Prize will be given to films selected by a panel of four respected filmmakers and scholars, based on quality and merit of the submissions.<br>\n*The Audience Prize will be determined through voting on Eventive during the screening period of the Short Film Competition. The winner of the Audience Prize will be announced together with the winners of the Grand Prize and Second Prize.</p>\n</section>\n<section>\n<h2>Requirements</h2>\n<h5>Eligibility</h5>\n<p>Filmmakers should be at least 18 years old and must be based in the United States.</p>\n<p>Film must not include copyrighted images, video or music.</p>\n<h5>Number of Submissions</h5>\n<p>Each director can submit a maximum of 2 short films.</p>\n<p>Films must not have been submitted to CMU IFF Short Film Competition before 2020</p>\n<h5>Other Festival Submissions and/or Awards</h5>\n<p>If the film has been submitted to other festivals and/or received any awards, please list them with submission.</p>\n<h5>Year</h5>\n<p>Film must have been made between 2018-2021.</p>\n<h5>Length</h5>\n<p>Films should be anywhere between 5 - 15 minutes in length.</p>\n<h5>Subtitles</h5>\n<p>If in a language other than English, and/or if audio is in any way muffled, subtitles are required.</p>\n<h5>Format</h5>\n<p>MP4 or MOV formats<br>\nUse H.264 codec<br>\nCode Rate: 5M per second<br>\nVideo size: 720P (1280x720)</p>\n<h5>Deadlines</h5>\n<p>The deadline for submission is 11:59 pm on April 24, 2021. Failure to submit prior to the due date may result in rejection from admittance.</p>\n</section>\n<section>\n<h2>Submission Process</h2>\n<p>The submission fee for this year’s short film competition is $20. If you submitted for the 2020 Short Film Competition, you can apply for a fee waiver*. The submissions will be made through <a href=\"https://filmfreeway.com/2021CarnegieMellonInternationalFilmFestivalShortFilmCompetition\">FilmFreeway</a>.</p>\n<ul>\n<li>SPECIAL PROMOTION: From now until April 24th, it is FREE to enter the competition!</li>\n</ul>\n</section>\n<section>\n<h2>Screening Event</h2>\n<p>This year’s festival will take place on May 15th. Each student whose work has been chosen gains the dual benefit of reactions from an audience and feedback from industry professionals.</p>\n<p>More details will be announced through our website, social media channels, and e-mail.</p>\n</section>\n<section>\n<h2>Contact</h2>\n<p>Please email <a href=\"mailto:cmusfc@gmail.com\">cmusfc@gmail.com</a> or Jolanta Lion at <a href=\"mailto:jola@andrew.cmu.edu\">jola@andrew.cmu.edu</a> for other payment methods, submission details, or any other questions concerning the Short Film Competition.</p>\n</section>\n<section>\n<h2>Sponsors</h2>\n<p>Proudly sponsored by: Carnegie Mellon University, University of Pittsburgh, Carlow University, Highmark, Armina Stone, Dr. Owen Cantor, Kara Bialecki, Moderna Relocation, Pittsburgh Humanities Festival, SCREENSHOT: Asia, Bosnian-Herzegovinian Film Festival in New York, WESA, WYEP, Harris Theater, The Colombian Spot, and Einhorn Media Group.</p>\n<p><a href=\"https://www.cmu.edu/faces/Assets/Short_Film_Competition/Warranties-Representations%20Right%20of%20Use%20and%20Indemnity.pdf\"><button class=\"btn btn-primary\">View Warranties/Representations, Right of Use and Indemnity</button></a></p>\n</section>\n","title":"Short Film Competition","activeItem":1}},"__N_SSG":true}