{"pageProps":{"articleData":{"id":"education","contentHtml":"<h1>Education</h1>\n<h2>Youth Outreach</h2>\n<p>The Carnegie Mellon International “Faces” Film Festival’s Youth Outreach Program, is a pioneering educational outreach program offered to schools throughout the Greater Pittsburgh Area that will focus on providing educational and creative platforms for youth to learn about narratives from around the world through international films and documentaries and to develop their own narratives in a hands-on documentary workshop, with the intended impact of enhancing students’ academic and civic engagement, critical thinking, and media literacy.</p>\n<p>The Youth Outreach Program will use the immersive medium of film, hands-on workshop, and interactive festival activities to fully engage young audiences in discussions on critical issues regarding intercultural awareness, media, and the 2016 festival theme of “Conflict”, providing a unique and educational experience that likely would not occur within the traditional classroom setting. Field trips will be coordinated to CMU IFF screenings where students will participate in thematic film screenings, interact with film directors and local professionals, and engage each other through interactive festival activities, including food receptions with ethnic cuisine and a “Work in Progress” Day. Additionally, a professional filmmaker will lead an in-class workshop on narrative storytelling while helping students learn media literacy and gain technical proficiency.</p>\n<p>The 2016 Youth Outreach Program is generously funded by <strong>CMU ProSEED’s Crosswalk Seed Grant</strong> and sponsored by <strong>The Sprout Fund</strong>.</p>\n<iframe class=\"trailer\" width=\"699\" height=\"393\" src=\"https://www.youtube.com/embed/qhKJDHCvyxM\" title=\"YouTube video player\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture\" allowfullscreen></iframe>\n<h2>Weekend Intensive Course</h2>\n<p>This course introduces students from all academic majors to the socio-political significance and artistic merits of film through screenings of acclaimed, international features and documentaries, class discussions, and workshops with award-winning filmmakers. The films are presented in conjunction with the Carnegie Mellon International Film Festival, a project of The Humanities Center, and focus on a different annual theme that addresses a current social issue. Each film in the festival lineup highlights global issues that are often hidden from mainstream media reporting.</p>\n<p>This course provides the rare opportunity to engage directly with the filmmakers, offering the chance to expand on the film’s controversial, global themes and learn more about the filmmaking industry and artistic process. Through viewing the films and learning of the filmmakers’ firsthand accounts, the students will hone their critical thinking skills and learn to read the mainstream media with a more discerning eye. Each student will translate the films’ themes, directors’ perspectives, class discussions and their own cultural backgrounds and personal experiences into a final written analysis as part of the pass/fail component of the course.</p>\n","title":"Education","activeItem":2}},"__N_SSG":true}